Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
            // Array-based axis parameter parsing with loop
            float desired[NUM_AXIS];
            float mpos[NUM_AXIS];
            
            // Parse all axis parameters using loop
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                desired[axis] = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
            }
            
            // Set offset = MachinePos - DesiredWorkPos (only X, Y, Z supported in WCS)
            for (E_AXIS axis = AXIS_X; axis < AXIS_Z + 1; axis++) {
                if (!isnan(desired[axis])) {
                    SET_COORDINATE_AXIS(&wcs->offset, axis, mpos[axis] - desired[axis]);
                }
            }
            
            return true;
        }

        if (gnum == 10) {
            char* pP = find_char((char*)cmd, 'P');
            char* pL = find_char((char*)cmd, 'L');
            int p_val = pP ? (int)strtol(pP + 1, NULL, 10) : 0;
            int l_val = pL ? (int)strtol(pL + 1, NULL, 10) : 0;
            if (l_val == 20) {
                if (p_val == 0 || p_val == 1) {
                    StepperPosition* pos = STEPPER_GetPosition();
                    WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
                    const float unit_scale = unitsInches ? 25.4f : 1.0f;
                    
                    // Array-based axis parameter parsing with loop
                    float desired[NUM_AXIS];
                    float mpos[NUM_AXIS];
                    
                    for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                        char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                        desired[axis] = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                        mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
                    }
                    
                    // Set WCS offset (only X, Y, Z supported)
                    for (E_AXIS axis = AXIS_X; axis < AXIS_Z + 1; axis++) {
                        if (!isnan(desired[axis])) {
                            SET_COORDINATE_AXIS(&wcs->offset, axis, mpos[axis] - desired[axis]);
                        }
                    }
                    
                    return true;
                } else {
                    return true;
                }
            } else {
                return true;
            }
        }

        if (gnum == 0 || gnum == 1) {
            ev->type = GCODE_EVENT_LINEAR_MOVE;
            DEBUG_PRINT_GCODE("[PARSE] Linear move (G%d)\r\n", gnum);
        } else if (gnum == 2) {
            ev->type = GCODE_EVENT_ARC_MOVE;
            ev->data.arcMove.clockwise = true;
            DEBUG_PRINT_GCODE("[PARSE] Arc CW (G2)\r\n");
        } else if (gnum == 3) {
            ev->type = GCODE_EVENT_ARC_MOVE;
            ev->data.arcMove.clockwise = false;
            DEBUG_PRINT_GCODE("[PARSE] Arc CCW (G3)\r\n");
        } else if (gnum == 4) {
            ev->type = GCODE_EVENT_DWELL;
            char* pP = strstr((char*)cmd, "P");
            ev->data.dwell.seconds = pP ? parse_float_after(pP) : 0.0f;
            return true;
        } else {
            return false;
        }

        // Array-based axis parameter parsing with loop
        char* pAxis[NUM_AXIS];
        float axis_values[NUM_AXIS];
        
        for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
            pAxis[axis] = find_char((char*)cmd, axis_letters[axis]);
            axis_values[axis] = pAxis[axis] ? parse_float_after(pAxis[axis]) : NAN;
        }
        
        char* pF = find_char((char*)cmd, 'F');
        const float unit_scale = unitsInches ? 25.4f : 1.0f;

        if (ev->type == GCODE_EVENT_LINEAR_MOVE) {
            float f = pF ? parse_float_after(pF) : 0.0f;
            // Event structure still uses hardcoded members (future refactoring opportunity)
            ev->data.linearMove.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
            ev->data.linearMove.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
            ev->data.linearMove.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
            ev->data.linearMove.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
            ev->data.linearMove.feedrate = (f > 0.0f) ? (f * unit_scale) : 0.0f;
            return true;
        } else if (ev->type == GCODE_EVENT_ARC_MOVE) {
            char* pI = find_char((char*)cmd, 'I');
            char* pJ = find_char((char*)cmd, 'J');
            float i = pI ? parse_float_after(pI) : 0.0f;
            float j = pJ ? parse_float_after(pJ) : 0.0f;
            float f = pF ? parse_float_after(pF) : 0.0f;
            // Event structure still uses hardcoded members (future refactoring opportunity)
            ev->data.arcMove.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
            ev->data.arcMove.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
            ev->data.arcMove.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
            ev->data.arcMove.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
            ev->data.arcMove.centerX = i * unit_scale;
            ev->data.arcMove.centerY = j * unit_scale;
            ev->data.arcMove.feedrate = (f > 0.0f) ? (f * unit_scale) : 0.0f;
            DEBUG_PRINT_GCODE("[PARSE] Arc params: X=%.2f Y=%.2f I=%.2f J=%.2f F=%.1f\r\n",
                             ev->data.arcMove.x, ev->data.arcMove.y, 
                             ev->data.arcMove.centerX, ev->data.arcMove.centerY, 
                             ev->data.arcMove.feedrate);
            return true;
        }
    }

    if (cmd[0] == 'F') {
        ev->type = GCODE_EVENT_SET_FEEDRATE;
        float f = (float)strtof(&cmd[1], NULL);
        ev->data.setFeedrate.feedrate = unitsInches ? (f * 25.4f) : f;
        return true;
    }
    if (cmd[0] == 'S') {
        ev->type = GCODE_EVENT_SET_SPINDLE_SPEED;
        ev->data.setSpindleSpeed.rpm = (uint32_t)strtoul(&cmd[1], NULL, 10);
        return true;
    }
    if (cmd[0] == 'T') {
        ev->type = GCODE_EVENT_SET_TOOL;
        ev->data.setTool.toolNumber = (uint32_t)strtoul(&cmd[1], NULL, 10);
        return true;
    }

    if (cmd[0] == 'M') {
        char* pend = NULL;
        int mnum = (int)strtol(&cmd[1], &pend, 10);
        if (mnum == 3) {
            ev->type = GCODE_EVENT_SPINDLE_ON;
            char* pS = find_char((char*)cmd, 'S');
            ev->data.spindle.rpm = pS ? (uint32_t)strtoul(pS + 1, NULL, 10) : 1000;
            return true;
        }
        if (mnum == 5) { ev->type = GCODE_EVENT_SPINDLE_OFF; return true; }
        if (mnum == 7) { ev->type = GCODE_EVENT_COOLANT_ON; return true; }
        if (mnum == 9) { ev->type = GCODE_EVENT_COOLANT_OFF; return true; }
    }
    
